# Parameter Type Id Wall Sweep Placement Vertical Property

Source: https://www.revitapidocs.com/2026/1b7ef081-8b37-5a51-fdf7-59a9fe0de1f1.htm

---

| Parameter Type Id Wall Sweep Placement Vertical Property |
| --- |

"Vertical"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId WallSweepPlacementVertical { get; }
```

```
Public Shared ReadOnly Property WallSweepPlacementVertical As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ WallSweepPlacementVertical {
	ForgeTypeId^ get ();
}
```

```
static member WallSweepPlacementVertical : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace